/*
 * 学籍番号・氏名 : 163334 佐野和輝
 * 授業回・課題番号 : 第1回・第1課題
 * 工夫した点 : CHAR_MAXなどの定数を利用し、マジックナンバーを使わないようにした。また、isprintを何回も呼び出さないようにした。
 */

#include <stdio.h>
/* CHAR_MAXを使用するため */
#include <limits.h>

/* charで表現できる文字コードの数 */
#define SIZE	(CHAR_MAX + 1)

int main(void)
{
	char c;
	int array[SIZE] = {0};
	int i;

	while ((c = getchar()) != EOF) {
		/* 文字コードcの出現数をarray[c]でカウントする */
		if(isprint(c))
			array[c]++;
	}

	for (i = 0; i < SIZE; i++) {
		/* カウント数が0でないもののみを表示する */
		if (array[i])
			printf("'%c' : %d\n", (char)i, array[i]);
	}

	return 0;
}

/*
実行結果:

im143:ex01 k163334$ gcc -o 163334_1_1 163334_1_1.c 
im143:ex01 k163334$ ./163334_1_1 < Alice_in_Wonderland.txt 
' ' : 28918
'!' : 450
'"' : 113
''' : 1763
'(' : 56
')' : 55
'*' : 60
',' : 2418
'-' : 669
'.' : 978
'0' : 1
'3' : 1
':' : 233
';' : 194
'?' : 202
'A' : 638
'B' : 91
'C' : 145
'D' : 192
'E' : 188
'F' : 74
'G' : 83
'H' : 284
'I' : 733
'J' : 8
'K' : 82
'L' : 98
'M' : 200
'N' : 120
'O' : 176
'P' : 64
'Q' : 84
'R' : 140
'S' : 218
'T' : 472
'U' : 66
'V' : 42
'W' : 237
'X' : 4
'Y' : 114
'Z' : 1
'[' : 2
']' : 2
'_' : 4
'`' : 1109
'a' : 8153
'b' : 1384
'c' : 2254
'd' : 4739
'e' : 13386
'f' : 1927
'g' : 2448
'h' : 7090
'i' : 6781
'j' : 138
'k' : 1076
'l' : 4618
'm' : 1907
'n' : 6896
'o' : 7970
'p' : 1460
'q' : 125
'r' : 5297
's' : 6282
't' : 10217
'u' : 3402
'v' : 804
'w' : 2438
'x' : 144
'y' : 2150
'z' : 77

*/

